{
  "backend/main.mo": "Actor exposing a simple healthCheck query returning a static service status string.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose across UI, storage, media, and state management.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global layout rules.",
  "frontend/index.html": "HTML entry point setting the app title to Aspen Clinic Snap and mounting the root React element.",
  "frontend/src/App.tsx": "Main React app handling initialization, PIN lock flow, auto‑lock, theming, and loading ClinicalSnapShell.",
  "frontend/src/components/camera/CameraCapturePanel.tsx": "Full‑screen camera component managing permissions, timeouts, capture flow, and saving photos to app state.",
  "frontend/src/components/layout/ClinicalSnapShell.tsx": "Primary UI shell with header, resizable panels, and overlays for settings, camera, voice memos, photo viewer, and comparisons.",
  "frontend/src/components/patients/PatientDeleteConfirmDialog.tsx": "Confirmation dialog for deleting a patient with warnings about cascading data removal.",
  "frontend/src/components/patients/PatientEditorDialog.tsx": "Modal form for creating or editing a patient, managing input state and saving via the app store.",
  "frontend/src/components/patients/PatientListPanel.tsx": "Displays searchable, sortable patient list with selection and create-patient dialog control.",
  "frontend/src/components/photos/PhotoAnnotationCanvas.tsx": "Canvas overlay that renders existing annotations and captures pen-drawn annotations for a photo.",
  "frontend/src/components/photos/PhotoAnnotationToolbar.tsx": "Toolbar for selecting annotation tools, colors, sizes, and clearing annotations for a photo.",
  "frontend/src/components/photos/PhotoThumbnailGrid.tsx": "Grid of photo thumbnails for a session with selection and deletion options.",
  "frontend/src/components/photos/PhotoViewerOverlay.tsx": "Full-screen photo viewer with zoom/pan and annotation mode integrating toolbar and canvas.",
  "frontend/src/components/photos/SessionPhotoImportButton.tsx": "Button that imports image files into a session, validates them, saves them sequentially, and shows toast feedback.",
  "frontend/src/components/security/PinLockScreen.tsx": "PIN entry screen with keypad that verifies a PIN through a callback and displays errors.",
  "frontend/src/components/sessions/SessionDeleteConfirmDialog.tsx": "Alert dialog asking the user to confirm deletion of a session and all its related data.",
  "frontend/src/components/sessions/SessionEditorDialog.tsx": "Dialog for creating or editing a session with title, date, and treatment type fields, including save logic and error handling.",
  "frontend/src/components/settings/AboutLocalOnlyNote.tsx": "Static info panel explaining the app’s local‑only data storage and privacy notes.",
  "frontend/src/components/settings/BrandingSettingsPanel.tsx": "Panel allowing users to edit clinic name and logo, including custom logo upload and preview.",
  "frontend/src/components/settings/PrivacySettingsPanel.tsx": "Panel for configuring PIN lock settings and auto‑lock timeout, with PIN validation and hashing.",
  "frontend/src/components/settings/SettingsSheet.tsx": "Right‑side settings sheet with tabs for branding, privacy, treatments, and about sections.",
  "frontend/src/components/settings/TreatmentTypesManager.tsx": "UI component for listing, creating, editing, and deleting treatment types with dialogs and form fields.",
  "frontend/src/components/viewer/BeforeAfterCompareDialog.tsx": "Dialog allowing users to pick before/after photos from a session and view them in a comparison slider.",
  "frontend/src/components/viewer/BeforeAfterSlider.tsx": "Interactive slider that reveals before and after images by dragging a divider.",
  "frontend/src/components/viewer/SessionTimelinePanel.tsx": "Displays a patient’s sessions and photos with options to edit sessions, manage patients, import photos, and open tools like camera or comparison.",
  "frontend/src/components/voice/VoiceMemoPanel.tsx": "Panel for recording, saving, playing, pausing, and deleting voice memos linked to a session.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and persisted identities.",
  "frontend/src/hooks/usePanZoom.ts": "Implements a touch-friendly pan and zoom hook supporting drag, wheel zoom, and pinch gestures for images.",
  "frontend/src/index.css": "Defines Tailwind layers and a clinical-themed color system with custom utilities and scrollbar styling.",
  "frontend/src/lib/media/audioMemo.ts": "Provides an AudioRecorder class for capturing audio memos and utilities to convert audio data to URLs.",
  "frontend/src/lib/media/photoStorage.ts": "Processes image files into full-resolution and thumbnail data with validation and helper utilities for loading and converting images.",
  "frontend/src/lib/models.ts": "Defines TypeScript domain models for patients, sessions, media, annotations, settings, and default treatment types.",
  "frontend/src/lib/search/filtering.ts": "Implements filtering utilities for patients and sessions based on query, treatment types, and date ranges.",
  "frontend/src/lib/security/pinLock.ts": "Provides PIN hashing and verification plus an AutoLockManager for inactivity-based app locking.",
  "frontend/src/lib/state/useAppStore.ts": "Zustand-based global store managing patients, sessions, photos, annotations, pairings, treatment types, voice memos, settings, and all CRUD actions tied to IndexedDB.",
  "frontend/src/lib/storage/indexedDb.ts": "IndexedDB wrapper providing initialization, object store setup, and generic CRUD helpers for all clinical data models.",
  "frontend/src/lib/storage/migrations.ts": "Runs initial database migrations, inserting default treatment types and app settings on first launch.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color variables, plugins, and responsive container settings.",
  "project_state.json": "Project state metadata documenting schema version, app summary, architecture notes, known issues, required images, and feature listings."
}