{
  "backend/main.mo": "Motoko actor with a single healthCheck query function that returns a status message confirming the backend is running.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for edit/delete patient actions in PatientListPanel with touch-friendly iPad interaction.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, utilities, state management, and storage layers with implementation details.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including clinical white and soft teal palette definitions.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Aspen Clinic Snap', and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component managing PIN lock state, auto-lock timeout, database migrations, data loading, and conditional rendering of PinLockScreen or ClinicalSnapShell.",
  "frontend/src/components/camera/CameraAlignmentGuidesOverlay.tsx": "Visual-only overlay component rendering rule-of-thirds grid, center crosshair, and corner markers with pointer-events-none to avoid blocking camera controls.",
  "frontend/src/components/camera/CameraCapturePanel.tsx": "Full-screen camera capture interface with iPad-hardened initialization, constraint fallback logic, alignment guides, ghost overlay, view template selection, and fallback system camera button with diagnostics.",
  "frontend/src/components/camera/CameraFlipToggle.tsx": "Button component for toggling between front and back camera with clear labeling, loading state, and touch-friendly sizing.",
  "frontend/src/components/camera/CameraOptionsToggles.tsx": "Reusable camera options UI with toggles for alignment guides, ghost overlay with opacity slider, and view template selection dropdown.",
  "frontend/src/components/camera/FallbackCameraCaptureButton.tsx": "A fallback button component that triggers the system file picker for image capture when native camera access is unavailable, with file validation and error handling.",
  "frontend/src/components/camera/GhostOverlayPickerDialog.tsx": "A dialog component for selecting a reference photo from the current session to use as a ghost overlay for alignment, displaying photos in a grid with selection state.",
  "frontend/src/components/layout/ClinicalSnapShell.tsx": "Main application shell with resizable panels for patient list and session timeline, managing overlays for camera capture, voice memos, photo viewer, and before/after comparison.",
  "frontend/src/components/patients/PatientDeleteConfirmDialog.tsx": "An alert dialog component that confirms patient deletion with a warning about permanent data removal.",
  "frontend/src/components/patients/PatientEditorDialog.tsx": "A dialog form for creating or editing patient records with fields for name, patient ID, date of birth, and treatment history.",
  "frontend/src/components/patients/PatientListPanel.tsx": "A panel displaying a searchable, scrollable list of patients with CRUD operations including edit and delete buttons, sorted by most recent update.",
  "frontend/src/components/photos/PhotoAnnotationCanvas.tsx": "A canvas overlay component for drawing and displaying photo annotations including pen strokes, highlights, text, and stamps (arrows, margin lines, prep lines).",
  "frontend/src/components/photos/PhotoAnnotationToolbar.tsx": "Annotation toolbar component providing pen, highlight, text, and stamp tools with color/size controls, plus undo and clear-all actions for photo annotations.",
  "frontend/src/components/photos/PhotoThumbnailGrid.tsx": "Grid display of photo thumbnails for a session with view template badges and dropdown menu for viewing, editing templates, and deleting photos.",
  "frontend/src/components/photos/PhotoViewerOverlay.tsx": "Full-screen photo viewer overlay with zoom/pan controls, annotation mode toggle, view template display/editing, and annotation canvas integration.",
  "frontend/src/components/photos/SessionPhotoImportButton.tsx": "Photo import button with file input handling, iPad compatibility, cancellation detection, and view template selection dialog for imported photos.",
  "frontend/src/components/photos/ViewTemplateEditorDialog.tsx": "Reusable dialog component for selecting or removing view templates from photos with save/cancel actions.",
  "frontend/src/components/security/PinLockScreen.tsx": "PIN entry lock screen with numeric keypad, input validation, and unlock verification for app security.",
  "frontend/src/components/sessions/SessionDeleteConfirmDialog.tsx": "Alert dialog component that prompts the user to confirm deletion of a session, warning that all photos, pairings, and voice memos will be permanently removed.",
  "frontend/src/components/sessions/SessionEditorDialog.tsx": "Dialog component for creating or editing a session with fields for title, date, and multi-select treatment type checkboxes. Handles session creation and updates via the app store.",
  "frontend/src/components/settings/AboutLocalOnlyNote.tsx": "Informational component displaying app branding, a privacy notice emphasizing local-only storage, and a footer with attribution to caffeine.ai.",
  "frontend/src/components/settings/BrandingSettingsPanel.tsx": "Settings panel for configuring clinic name and logo (default or custom upload) with live preview and save functionality.",
  "frontend/src/components/settings/PrivacySettingsPanel.tsx": "Settings panel for enabling PIN lock, setting/changing PIN, and configuring auto-lock timeout with validation and secure PIN hashing.",
  "frontend/src/components/settings/SettingsSheet.tsx": "Side sheet component with tabbed interface for accessing branding, privacy, treatment types, and about settings panels.",
  "frontend/src/components/settings/TreatmentTypesManager.tsx": "Management interface for creating, editing, and deleting treatment types with name and color properties, displayed in a scrollable list with action buttons.",
  "frontend/src/components/viewer/BeforeAfterCompareDialog.tsx": "Dialog component for selecting and comparing before/after photos with slider and overlay modes, plus fullscreen view option.",
  "frontend/src/components/viewer/BeforeAfterFullscreenOverlay.tsx": "Full-screen overlay component for before/after photo comparison with slider and opacity-controlled overlay modes.",
  "frontend/src/components/viewer/BeforeAfterSlider.tsx": "Touch-friendly swipe-reveal slider component for before/after photo comparison using pointer events and clip-path.",
  "frontend/src/components/viewer/SessionTimelinePanel.tsx": "Panel displaying patient sessions in timeline format with photo grids and action buttons for camera, voice memos, photo import, and before/after comparison.",
  "frontend/src/components/voice/FallbackVoiceMemoCaptureButton.tsx": "Fallback audio capture button using file picker for iPad Safari compatibility, with MIME type detection and duration estimation.",
  "frontend/src/components/voice/VoiceMemoPanel.tsx": "Sheet panel for recording, playing, and managing voice memos with error handling, fallback capture option, and separate audio players for pending and saved recordings.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioPlayer.ts": "React hook for audio playback with MIME type support, play/pause/stop controls, error handling, and automatic cleanup on unmount.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/usePanZoom.ts": "React hook providing touch-friendly pan and zoom functionality for images with pinch-to-zoom, wheel zoom, and drag support.",
  "frontend/src/index.css": "Tailwind CSS configuration with clinical-themed color palette (soft teal/white), touch-friendly utilities for large targets, camera preview container styles, and dark mode support.",
  "frontend/src/lib/export/sessionPdfExport.ts": "Empty file for session PDF export functionality.",
  "frontend/src/lib/media/audioMemo.ts": "Audio recording utility class with MIME type detection, permission handling, error categorization, and duration tracking for creating audio memos.",
  "frontend/src/lib/media/cameraDiagnostics.ts": "Structured diagnostic logging system for camera and import operations that categorizes errors and explicitly prohibits logging patient/session IDs or media content.",
  "frontend/src/lib/media/cameraPreviewValidation.ts": "Validates video preview readiness by checking dimensions, readyState, frame advancement, and element visibility with timeout handling, specifically addressing iPad Safari black screen issues.",
  "frontend/src/lib/media/photoStorage.ts": "Handles photo capture from file input with validation, image decoding, thumbnail generation, and comprehensive error handling with user-friendly messages for iPad Safari compatibility.",
  "frontend/src/lib/models.ts": "Defines TypeScript interfaces for all domain models (Patient, Session, Photo, Annotation, BeforeAfterPairing, TreatmentType, VoiceMemo, Settings) with default treatment types and view templates, including multi-treatment support.",
  "frontend/src/lib/search/filtering.ts": "Provides search and filter utilities for patients and sessions by query text, treatment type names/IDs, and date ranges with support for multi-treatment sessions.",
  "frontend/src/lib/security/pinLock.ts": "Implements PIN hashing with SHA-256, verification, and auto-lock manager that triggers lock after configurable inactivity timeout with user activity detection.",
  "frontend/src/lib/state/useAppStore.ts": "Zustand store managing global app state with CRUD actions for all entities (patients, sessions, photos, annotations, pairings, treatment types, voice memos, settings) and immediate state updates after IndexedDB writes.",
  "frontend/src/lib/storage/indexedDb.ts": "IndexedDB wrapper providing persistence layer with schema definition, initialization, upgrade handling, and generic CRUD operations for all clinical data with indexes on foreign keys.",
  "frontend/src/lib/storage/migrations.ts": "Handles IndexedDB schema migrations including initializing default treatment types and settings on first run, migrating sessions to support multiple treatment types, and backfilling MIME types for voice memos.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing an iPad clinical photography app for dental/aesthetic clinics with patient profiles, session-based photo organization, before/after comparisons, and on-device privacy; lists known issues including broken session addition, missing annotations, and scroll/pagination problems."
}