{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add edit and delete options for patient profiles",
  "requirements": [
    {
      "id": "REQ-83",
      "summary": "Add Edit Patient action to PatientListPanel to modify patient name, ID, DOB, and treatment history using PatientEditorDialog",
      "acceptanceCriteria": [
        "The PatientListPanel displays an Edit action (button or menu item) for each patient entry",
        "Tapping Edit opens the PatientEditorDialog pre-populated with the patient's current data",
        "Changes to patient name, ID, DOB, or treatment history can be saved and persist to IndexedDB",
        "The patient list updates immediately after saving edits to reflect the new patient name"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/patients/PatientListPanel.tsx",
          "operation": "modify",
          "description": "Add an Edit button/action to each patient card that opens the PatientEditorDialog in edit mode with the selected patient's data pre-populated. Ensure the button has a touch target size of at least 44x44 points and is clearly labeled with text or an icon. Wire the edit action to pass the patient data to the dialog."
        },
        {
          "path": "frontend/src/components/patients/PatientEditorDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog can accept a patient object as a prop to enter edit mode, pre-populating all fields (name, patient ID, date of birth, treatment history notes) with the patient's current data. Verify that saving updates the patient record in the app store and that changes persist to IndexedDB."
        }
      ]
    },
    {
      "id": "REQ-84",
      "summary": "Add Delete Patient action to PatientListPanel with PatientDeleteConfirmDialog that cascades deletion to all related entities",
      "acceptanceCriteria": [
        "The PatientListPanel displays a Delete action (button or menu item) for each patient entry",
        "Tapping Delete shows the PatientDeleteConfirmDialog with a clear warning about permanent data removal",
        "Confirming deletion removes the patient and cascades deletion to all related sessions, photos, annotations, pairings, and voice memos",
        "The patient list updates immediately after deletion and no longer shows the deleted patient",
        "If the deleted patient was currently selected, the UI clears the selection or selects another patient"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/patients/PatientListPanel.tsx",
          "operation": "modify",
          "description": "Add a Delete button/action to each patient card that opens the PatientDeleteConfirmDialog with the selected patient's information. Ensure the button has a touch target size of at least 44x44 points and is clearly labeled. Handle the deletion confirmation callback to trigger cascading deletion from the app store. If the deleted patient was currently selected, clear the selection or select another patient."
        },
        {
          "path": "frontend/src/components/patients/PatientDeleteConfirmDialog.tsx",
          "operation": "modify",
          "description": "Ensure the dialog accepts patient data as a prop, displays the patient's name in the confirmation message, and provides a clear warning about permanent data removal. Wire the confirm action to trigger cascading deletion in the app store that removes all related sessions, photos, annotations, pairings, and voice memos."
        },
        {
          "path": "frontend/src/lib/state/useAppStore.ts",
          "operation": "modify",
          "description": "Add or enhance a cascading delete patient action that removes the patient record and all related entities from IndexedDB: sessions, photos, annotations, pairings, and voice memos. Ensure no orphaned data remains after deletion. The deletion logic should query all sessions for the patient, collect all photo IDs, annotation IDs, pairing IDs, and voice memo IDs, then delete them all in the correct order."
        }
      ]
    },
    {
      "id": "REQ-85",
      "summary": "Ensure Edit and Delete actions in PatientListPanel are touch-friendly and suitable for iPad interaction",
      "acceptanceCriteria": [
        "Edit and Delete buttons/menu items have touch target sizes of at least 44x44 points",
        "Actions are clearly labeled with text or universally recognizable icons",
        "Actions are accessible without requiring precise tapping or nested menus"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/patients/PatientListPanel.tsx",
          "operation": "modify",
          "description": "Verify that Edit and Delete action buttons meet touch target size requirements (at least 44x44 points). Use clear text labels or universally recognizable icons (e.g., pencil for edit, trash for delete). Ensure actions are easily accessible without nested menus or requiring precise tapping. Apply appropriate spacing between action buttons to prevent accidental taps."
        }
      ]
    }
  ]
}